app/views/students/index.html.erb

        <b>Currently resides in:</b> <%= student.country %><br>
        Currently matched with <b><%= student.matchings.count %></b> tutor(s)<br>
---
SELECT COUNT(*) FROM "matchings" WHERE "matchings"."student_id" = $1  [["student_id", 1]]