app/views/students/mytutors.html.erb

SELECT "matchings".* FROM "matchings" WHERE "matchings"."student_id" = ?  [["student_id", 31]]
SELECT 1 AS one FROM "matchings" WHERE "matchings"."student_id" = $1 LIMIT $2  [["student_id", 2], ["LIMIT", 1]]
SELECT "tutors".* FROM "tutors" INNER JOIN "matchings" ON "tutors"."id" = "matchings"."tutor_id" WHERE "matchings"."student_id" = $1  [["student_id", 2]]
---

    <% if !@student.matchings.empty? %>
        <ul>
            <% @student.tutors.each do |tutor| %>