app/views/tutors/mystudents.html.erb

SELECT 1 AS one FROM "matchings" WHERE "matchings"."tutor_id" = $1 LIMIT $2  [["tutor_id", 2], ["LIMIT", 1]]
SELECT "students".* FROM "students" INNER JOIN "matchings" ON "students"."id" = "matchings"."student_id" WHERE "matchings"."tutor_id" = $1  [["tutor_id", 2]]
---

    <% if !@tutor.matchings.empty? %>
        <ul>
            <% @tutor.students.each do |student| %>