app/controllers/application_controller.rb

  def current_student
    if session[:student_id]
      @current_student ||= Student.find(session[:student_id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def current_tutor
    if session[:tutor_id]
      @current_tutor ||= Tutor.find(session[:tutor_id])
---
SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]