app/controllers/matchings_controller.rb

  def show
    @matching = Matching.find(params[:id])
---
SELECT "matchings".* FROM "matchings" WHERE "matchings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def index
    if @current_student
      @matchings = @current_student.matchings
    elsif @current_tutor
      @matchings = @current_tutor.matchings
    else
      @matchings = Matching.all
---
SELECT "matchings".* FROM "matchings" WHERE "matchings"."student_id" = ?  [["student_id", 3]]

  def new
    #initialize but not save an empty matching; so that the form we renders knows which fields to use and where to submit
    @matching = Matching.new
    @students = Student.all
    @tutors = Tutor.all
---
SELECT "students".* FROM "students"
SELECT "tutors".* FROM "tutors"

  def create
    @matching = Matching.new(matching_params)

    if !session[:tutor_id] || session[:tutor_id] != @matching.tutor.id
      redirect_to root_url
      return
    end

    if @matching.save
---
INSERT INTO "matchings" ("tutor_id", "student_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tutor_id", 1], ["student_id", 1], ["created_at", "2021-01-17 04:40:52.639147"], ["updated_at", "2021-01-17 04:40:52.639147"]]