app/controllers/students_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 75], ["LIMIT", 1]]
---
  def show
    # disallow a student to view a non-existing student's profile
    begin
      @student = Student.find(params[:id])

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def mytutors
    @student = Student.find(params[:id])

INSERT INTO "students" ("name", "country", "level", "created_at", "updated_at", "email", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @student = Student.new(student_params)

    if @student.save

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def edit
    # disallow a student to edit a non-existing student's profile
    begin
      @student = Student.find(params[:id])

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "students" SET "updated_at" = $1, "password_digest" = $2 WHERE "students"."id" = $3  [["updated_at", "2021-01-17 03:11:46.066335"], ["password_digest", "$2a$12$dfTXaqESXlCwrM6kngD9R.mwtQHU8fwdKu1SUhSf103mTfyeEW8Fq"], ["id", 6]]
---
  def update
    @student = Student.find(params[:id])

    if @student.update(student_params)