app/controllers/student_sessions_controller.rb

  def create
    student = Student.find_by_email(params[:email])
---
SELECT "students".* FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "nada@mail.mcgill.ca"], ["LIMIT", 1]]