app/controllers/tutors_controller.rb

SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    # disallow a tutor to view a non-existing tutor's profile
    begin
      @tutor = Tutor.find(params[:id])

SELECT "tutors".* FROM "tutors"
---
  def index
    @tutors = Tutor.all

SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def mystudents
    @tutor = Tutor.find(params[:id])

INSERT INTO "tutors" ("name", "country", "created_at", "updated_at", "email", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @tutor = Tutor.new(tutor_params)

    if @tutor.save

SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    # disallow a tutor to edit a non-existing tutor's profile
    begin
      @tutor = Tutor.find(params[:id])

SELECT "tutors".* FROM "tutors" WHERE "tutors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "tutors" SET "updated_at" = $1, "password_digest" = $2 WHERE "tutors"."id" = $3  [["updated_at", "2021-01-17 02:51:06.787658"], ["password_digest", "$2a$12$3FLmwa2ZF2Hsyz3xPdPWk.wXLstQPdqvhqDjIavxlG7n13hfapWRm"], ["id", 2]]
---
  def update
    @tutor = Tutor.find(params[:id])

    if @tutor.update(tutor_params)