app/controllers/tutor_sessions_controller.rb

SELECT "tutors".* FROM "tutors" WHERE "tutors"."email" = ? LIMIT ?  [["email", "nadaa@mail.mcgill.ca"], ["LIMIT", 1]]
---
  def create
    tutor = Tutor.find_by_email(params[:email])